Revit 2027 API
DialogBoxData.HelpId Property
 An ID that represents the dialog that has been displayed.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int HelpId { get; }
Public ReadOnly Property HelpId As Integer
	Get
public:
property int HelpId {
	int get ();
}
member HelpId : int with get
Property Value
Int32
Remarks
 Use this ID within your application to key suitable responses for the dialog. Note: this id is not guaranteed to remain stable for different builds of Autodesk Revit.
See Also
Reference
DialogBoxData Class
Autodesk.Revit.UI.Events Namespace